{
  "name": "Daryl Walsh",
  "blurb": "Full-Stack Application & Front End Developer with DevOps experience",
  "links": [
    {
      "title": "darylwalsh@gmail.com",
      "url": "mailto:darylwalsh@gmail.com",
      "icon": "fas fa-envelope",
      "newtab": false
    },
    {
      "title": "(989)912-5820",
      "url": "tel:9899125820",
      "icon": "fas fa-phone"
    },
     {
      "title": "(615)209-8060",
      "url": "tel:6152098060",
      "icon": "fas fa-phone"
    },
    {
      "title": "github.com/darylwalsh",
      "url": "https://github.com/darylwalsh",
      "icon": "fab fa-github"
    },
    {
      "title": "gitlab.com/darylwalsh",
      "url": "https://www.gitlab.com/darylwalsh",
      "icon": "fab fa-gitlab"
    }
  ],
  "experiences": [
     {
      "title": "Nexient LLC",
      "timestamp": "December 2019-November 2022",
      "points": [
        "Role – Senior Developer - React Vue Java AWS Docker Ansible Jenkins Kubernetes IaC",
        "Consultant working directly with clients, including Williams-Sonoma, Levi's and PG&E (see details of each below)"
      ]
    },
    {
      "title": "Nexient -- Williams-Sonoma",
      "timestamp": "January 2021-September 2022",
      "points": [
        "Role – Senior Developer - Vue React Java AWS Docker Ansible Jenkins Kubernetes",
        "Developed multiple features for WSI's various ecommerce sites and apps: fabric swatch guide, related products components, pricing component, accessibility and general enhancements and maintenance of the WSI product micro-frontend",
        "• Worked as part of a team dedicated to the product micro-frontend component of WSI's web properties",
        "• Front-end code in VueJS with React for development and MFE",
        "• Front-end written in HTML, Tailwind CSS and Javascript based Vue with React MFE.",
        "• Spring Boot REST API",
        "• Unit tests written in Jest and JUnit, end to end testing via Playwright",
        "• The transition of the back-end from pre-Spring Java to Spring Boot and the front-end to a micro-frontend architecture created various day to day development challenges",
        "• Internal application to manage microfront end app development written in React",
        "• Mentored newer developers and assisted with overcoming the challenges presented by the transitioning development environments"
      ]
    },
    { 
      "title": "Nexient -- Levi's",
      "timestamp": "June 2020-December 2020",
      "points": [
        "Role –  Senior Developer - React Native Vue GraphQL Neo4j Terraform IaC",
        "Developed Curbside Pickup, Find Online Buy-in-Store and Shop-By-Appt additions to Levi's ecommerce experience",
        "• Worked as part of a large team spread across internal Levi's developers and outside consultants",
        "• Front-end code for ecommerce component written in VueJS",
        "• Vue front-end connected to Levi's internal back-end systems via GraphQL instance",
        "• Front-end written in HTML, CSS and Javascript based Vue.",
        "• Middleware API written in GraphQL",
        "• Particular challenges included internationalization as Levi's deployed the functionality in more than a dozen nations",
        "• In addition to working on Levi's ecommerce site, worked on an internal to Levi's supply-chain product-design and sales/marketing application, converted from Vue to React Native.",
        "• Used Terraform infrastructure-as-code to create replicable CI/CD pipelines"
      ]
    },
    {
      "title": "Nexient -- PG&E",
      "timestamp": "January 2020-June 2020",
      "points": [
        "Role –  Senior Developer - React React Native AWS Spring Boot REST API GitHubActions CloudFormation Docker AWS EKS IaC",
        "• Front-end app code in React/React Native",
        "• Front-end app written in HTML, Tailwind CSS and Javascript based React/React Native.",
        "• Developed Safety Infrastructure Protection Team (SIPT) application for iPad and desktop to allow PG&E field workers to schedule and complete work assignments.",
        "• Worked with a team of 7 to take project from conception through design and development to deployment in production on AWS",
        "• Front-end app code in React/React Native via ejected Expo",
        "• React front-end app deployed to AWS, responsible for creating and maintaining AWS pipeline",
        "• Middleware API written in Java (Spring Boot), hosted on premise at PG&E.",
        "• Wrote GitHub Actions and CloudFormation templates to deploy Development, Test, Production CI/CD pipelines as infrastructure-as-code",
        "• SIPT Fieldworker application in production in time for Summer 2020 fire season and still in use today."
      ]
    },
    {
      "title": "ExamBuilder",
      "timestamp": "June 2018-November 2019 remote",
      "points": [
        "Role –  Developer - Contract",
        "Developed updated version of ExamBuilder’s exam building application which is used by companies such as UBS, Microsoft, Medtronic to build, administer and track exams given to employees.",
        "• Worked with another developer to formulate a Ruby on Rails REST style framework (no code generation, only for organizing code).",
        "• Divided actual building of application with 2nd developer so each developer was responsible for all aspects (front-end and  back-end/full-stack development) of their part of the application.",
        "• Calls to Oracle database were made to stored procedures via REST interface",
        "• RESTful Interface used to deliver data to front-end and to validate and write data to Oracle database.",
        "• Front-end written in HTML, CSS and Javascript based React.",
        "• ExamBuilder application in production for more than a decade prior to our update. We completed a comprehensive update and our code is currently in service to companies in the U.S., Canada, Europe and Asia."
      ]
    },
    {
      "title": "Avanzado",
      "timestamp": "February 2017-May 2018 Michigan",
      "points": [
        "Developed and maintained web and intranet applications for printing industry clients.",
        "Also designed and developed Ansible based process to migrate hosting from on-premise to cloud.",
        "React.js, Bootstrap, Express, Node.js, GIT, HTML/HTML 5, CSS/CSS3, Responsive Design, Ansible"
      ]
    },
    {
      "title": "ADMI",
      "timestamp": "June 2015-November 2016 Michigan",
      "points": [
        "Developed extranet applications to interface with external clients and allow client self-service/data retrieval for auto industry clients.",
        "Node, React, GIT, HTML, CSS, Bootstrap, Responsive Design, Oracle"
      ]
    },
    {
      "title": "Blue Cross Blue Shield of Michigan",
      "timestamp": "October 2014-May 2015",
      "points": [
        "Lead developer on a project to build on internal application to facilitate internal application development, approval and source control at Blue Cross and Blue Shield of Michigan in downtown Detroit. ",
        "Angular.js, SQL Server, Bootstrap, SASS, ColdFusion, Express, Node.js, Jasmine, bower, grunt, GIT, HTML/HTML 5, CSS/CSS3, Responsive Design, Ajax"
      ]
    },
    {
      "title": "dotomi",
      "timestamp": "June 2014-December 2014 Illinois",
      "points": [
        "Contract Web Developer for an external, responsive Client Access Portal built in angular.js, node.js, Express, MongoDB.",
        "Using Protractor for automated end to end testing and Karma for unit testing.",
        "The CAP (Client Access Portal) project served as a model application for development using the MEAN platform with automated testing.",
        " Angular.js, MongoDB, Express, Node.js, Protractor, Karma, Jasmine, bower, grunt, HTML/HTML 5, CSS/CSS3, Responsive Design, Ajax"
      ]
    },
    {
      "title": "Discovery Communications",
      "timestamp": "April 2013-June 2014 Illinois",
      "points": [
        "Contract Web Developer for various projects including:",
        "  http://stem.discoveryeducation.com/",
        "   http://www.toyotateendriver.com/",
        "   http://educationstation.discoveryeducation.com/",
        "   http://www.discoveryeducation.com/",
        "   plus additional sites.",
        "Highlights included:",
        " Convert Education Station to a responsive design using Foundation",
        " Convert Toyota Teen Driver to a responsive Drupal site.",
        " Implemented Angular.js forms on various sites.",
        " Implemented require.js to optimize on-demand javascript loading",
        " Set up video delivery using node.js and HTML5",
        " Set up a ‘Golden Ticket’ contest, including all database and front-end development.",
        "jQuery, Javascript, Angular.js, require.js, HTML/HTML 5, CSS/CSS3, jQuery Mobile, Foundation, Bootstrap, Ajax, Flash, PHP, CFM, Ajax"
      ]
    },
    {
      "title": "G7W Enterprises",
      "timestamp": "June 2013-March 2013 Illinois",
      "points": [
        "Implemented Responsys email marketing campaign and tied it into a SQL Server back-end via Responsys SOAP API:",
        "- Connected a travel site database containing over a million registered users.",
        "Set up Google Analytics and related reports via Google’s API. ",
        "- Set up Google Analytics tracking and reports for an ecommerce website."
      ]
    },
    {
      "title": "Chicago Sun-Times",
      "timestamp": "January 2011-January 2013 Illinois",
      "points": [
        "Senior Developer for various projects including:",
        "Generally responsible for maintenance and new development for all Chicago Sun-Times properties, desktop/mobile/tablet:",
        "• Chicago Sun-Times",
        "• 32 Pioneer Press Suburban papers",
        "•  8 Suburban Daily paper",
        "•  Chicago Reader",
        "•  The Daily Splash",
        "•   Season Pass (High School sports site)",
        "Highlights included:",
        "• Re-skin all Pioneer Press Publications;",
        "• Implemented a pay wall for the Sun-Times;",
        "• Implemented interstitial ads for the Sun-Times;",
        "• Implementing social media log-in and connected it to the back-end CMS throughout Sun-Times online properties, including desktop, iPad and Android/iOS handheld devices",
        "• Set up streaming video using node.js and HTML5",
        "• Mentored newer developers",
        " HTML/HTML 5, CSS/CSS3, jQuery, Ajax, Flash, PHP, Ruby on Rails, Python/PERL, JSP, CFM, Ajax and Cache"
      ]
    },
    {
      "title": "Sears Holdings Corporation",
      "timestamp": "June 2010 - November 2010 Illinois",
      "points": [
        "Contract Web Developer for various projects including:",
        "completing a rewrite of sears.com consumer-facing e-commerce site to integrate social media into the user's shopping experience, optimize CSS/HTML;",
        "responsible for maintenance and updates of in-production applications via jira ticket system.",
        "Ajax, HTML, CSS, jQuery, HTML 5, Python, Proprietary CMS"
      ]
    },
    {
      "title": "Chicago Tribune Media",
      "timestamp": "November 2009 – May 2010 Illinois",
      "points": [
        "Contract Web Developer working on various Tribune Company media properties",
        "including developing a Flash/Flex Facebook application for the NCAA March",
        "Madness tournament as well as maintaining in production applications.",
        "Utilized jQuery, Prototype, CSS, xHTML, Ruby on Rails, PHP, JSP",
        "Ajax, HTML, CSS, jQuery, RoR, PHP, JSP"
      ]
    },
    {
      "title": "Alcatel-Lucent",
      "timestamp": "December 2008- November 2009 Illinois",
      "points": [
        " Key developer on the CARES 10 project, worked on feature upgrades from technical design to coding and development to UAT and deployment.",
        "JavaScript/jQuery, ColdFusion, CSS, HTML, AJAX, Selenium, CFM, Oracle, JSP"
      ]
    },
    {
      "title": "PEPSICO Chicago  (Quaker-Tropicana-Gatorade)",
      "timestamp": "December 2007-November 2008 Illinois",
      "points": [
        "Role – Developer Contract",
        "• Maintained and upgraded PEPSICO’s core Supply Chain Replenishment (SCR) application which combined a web-based front-end with an Oracle 9i/10g database.",
        "Additional responsibilities:",
        "• Maintained PepsiCo’s shipping application CODA (HTML/CSS/js with an Oracle back-end)",
        "• Provided support for a jsp Documentum application.",
        "JavaScript/jQuery, ColdFusion, CSS, HTML, AJAX, Selenium, CFM, Oracle, JSP"
      ]
    },
    {
      "title": "Nerdwerx-JJCamper",
      "timestamp": "Independent Contract 2007 Illinois",
      "points": [
        "Role - Web Developer - Contract",
        "• Developed public site for recreational vehicle sales and storage;",
        "• Developed administration application to allow updating of site content and",
        "product inventory; admin application also allows management of sales leads and",
        "RV storage rental. Public site allows secured processing of storage payments.",
        "ColdFusion, Model-Glue, CFAJAX, CSS, HTML, SQL SERVER 2000"
      ]
    },
    {
      "title": "AARP",
      "timestamp": "Independent contract 2007 Illinois",
      "points": [
        "Role - Web Developer -Contract",
        "Developed reporting system for new AARP ecommerce site, including over 30 reports on sales, keyword searches and site use. Also performed customization, upgrades and maintenance to ColdFusion based ecommerce package."
      ]
    },
    {
      "title": "Chicago Humanities Festival",
      "timestamp": "Independent Contract 2006 remote",
      "points": [
        "Role - Web Developer -Contract",
        "• Lead ColdFusion Developer on project to create 2006 version of the Chicago Humanities Festival Website in ColdFusion and SQL SERVER.",
        "JavaScript/jQuery, CSS, HTML, AJAX, CFM, SQL Server"
      ]
    },
    {
      "title": "Eshots, Inc",
      "timestamp": "Independent Contract 2006 remote",
      "points": [
        "Key Deliverables - Convert Eshots event manager application from one database back-end to another.• Convert an application written in CFMX with a MYSQL back-end database to an updated SQL Server database structure.",
        "• Program user-interface enhancements in AJAX and CFML",
        "• Update XML scripts for loading Eshots primary product to its central server.",
        "• Worked directly at the client site",
        "• 90% new development, 10% maintenance",
        "MySQL, ColdFusion, JavaScript, HTML, AJAX"
      ]
    },
    {
      "title": "Lightology, Inc",
      "timestamp": "November 2003 - February 2006 Illinois",
      "points": [
        "Role -Lead Developer for Lightology.com",
        "Key Deliverables:",
        "--Maintain legacy Lightology e-commerce site and related Intranet and Project Manager Applications and convert site and applications to Lightology's new ERP system.",
        "Full Lifecycle Application Development, Application Maintenance",
        "• Maintain and upgrade Lightology's existing Web, Intranet and Project Manager applications",
        "• Convert Lightology's existing Web, Intranet and Project Manager applications from one ERP back-end to another.",
        "• 80% new development, 20% maintenance",
        "SQL Server, Progress, ColdFusion, Java, JavaScript, HTML, AJAX, Flash"
      ]
    },
    {
      "title": "Discover Financial Services",
      "timestamp": "August 2003-November 2003 Illinois",
      "points": [
        "Key Deliverables -- Developing enhancements and providing support for a learning management system.",
        "Full Lifecycle Application Development, Application Maintenance",
        "• Convert an application written in ColdFusion 5.0 to a Flash front end with ColdFusion.",
        "• Program user-interface enhancements in Flash and ColdFusion",
        "• Working directly at the client site on a team of four people",
        "• 70% new development, 30% maintenance",
        "SQL Server, ColdFusion, Flash, JavaScript, HTML"
      ]
    },
    {
      "title": "AMD Industries",
      "timestamp": "January 2003 to August 2003 Illinois",
      "points": [
        "Key Deliverables - http://www.amdpop.com, System Conversion to Web-based Portal, Full Lifecycle Application Development, Application Maintenance",
        "• Converted AMD’s legacy VB/SQL Server 2000 Ordering/Shipping system to a Web-based portal using ColdFusion MX/SQL Server 2002",
        "• Also added the ability for AMD’s customers to place orders via the Web, view Order status and generate custom Excel reports",
        "• Order status and generate custom Excel reports",
        "• Programmed user-interface enhancements in JavaScript and Flash",
        "• Worked directly with the client on a team of two people",
        "• Responsible for full lifecycle of the application: Design, Coding, Testing,",
        "• Worked directly with the client on a team of two people",
        "• Responsible for full lifecycle of the application: Design, Coding, Testing, Debugging, Implementation, User Training",
        "• 90% new development, 10% maintenance",
        "SQL Server 2000, ColdFusion MX, Visual Basic, Flash, JavaScript, HTML"
      ]
    },
    {
      "title": "Liquidprint",
      "timestamp": "February 2001 to December 2002 Illinois",
      "points": [
        "Role - Web Application Developer",
        "Key Deliverables - Web Site Application Development / Maintenance, Database Design / Development, ColdFusion/ASP Coding, Client Communications, Full Lifecycle Development",
        "Responsible for the development of applications for numerous client web sites and intranets, which typically use CFM, ASP, JSP, SQL Server (7.0/2000) for development",
        "Worked solo or on teams ranging from 2 to 6 people",
        "Functioned as the database designer/developer and ColdFusion/ASP Coder back-end with occasional front-end responsibilities",
        "Frequent client interaction",
        "Full Lifecycle Development as well as code maintenance (50/50)",
        "http://www.grossinger.com",
        "Programmed entire site, including content management portion",
        "• Fusebox site",
        "• Does daily inventory imports using XML into SQL Server",
        "http://www.hometouch.com/",
        "• Intranet---Extensive Leads Management System for Buyer Representatives",
        "• Utilized XML to share Buyer lead data among various back-end systems",
        "• Fusebox Application",
        "http://www.fsboillinois.com",
        "• Programmed entire site, including back-end to allow client to update site",
        "• Fusebox site",
        "http://www.portcement.org/",
        "• Responsible for maintenance of this ASP site",
        "• ASP and SQL Server",
        "http://www.prufoxroach.com/pfrpublic/",
        "• Programmed SOAP calls using XML",
        "• Oracle database and ASP.Net site",
        "Additional projects worked on include: http://www.gmacrealestate.com/ http://www.performancebike.com/ , http://www.carlsonre.com/",
        "SQL Server (7.0/2000), CFM, ASP, XML, JavaScript, Flash, Oracle, Access, HTML, ActionScript, CFC’s"
      ]
    }
  ],
  "projects": [
    {
      "name": {
        "title": "www.reactolatry.io",
        "url": "http://www.reactolatry.io"
      },
      "link": {
        "title": "github.com/darylwalsh/ecto-phx-gql-react",
        "url": "https://github.com/daryl-walsh/ecto-phx-gql-react"
      },
      "points": [
        "Full Stack React with GraphQL via Apollo/Absinthe resolving to a Phoenix/Ecto schema in front of a Postgres db",
        "Deployed via Docker containers on a Kubernetes cluster with Helm charts"
      ]
    },
    {
      "name": {
        "title": "www.hooroo.sh",
        "url": "http://www.hooroo.sh"
      },
      "link": {
        "title": "gitlab.com/darylwalsh/hooroosh",
        "url": "https://gitlab.com/darylwalsh/hooroosh"
      },
      "points": [
        "Front end: TypeScript, React, Webpack, Bulma, Apollo",
        "Back end: Elixir, Phoenix, Ecto, Absinthe, GraphQL, Arc, ExAws, PostgreSQL"
      ]
    },
    {
      "name": {
        "title": "stage.smallbatchreact.io",
        "url": "http://stage.smallbatchreact.io"
      },
      "link": {
        "title": "github.com/darylwalsh/small-batch-react",
        "url": "https://github.com/daryl-walsh/small-batch-react"
      },
      "points": [
        "App deployed on AWS via Docker/k8s as discrete microservices:",
        "- users - server-side Flask app for managing users and auth",
        "- client - client-side React app",
        "- nginx - reverse proxy web server",
        "- swagger - Swagger API docs",
        "- scores - server-side Flask app for managing user scores",
        "- exercises - server-side Flask app for managing exercises",
        "Tools and Technologies:",
        "* Python",
        "* Flask",
        "* Docker",
        "* Postgres",
        "* Node and NPM",
        "* React",
        "* Cypress",
        "* Swagger",
        "* Amazon Web Services (AWS)",
        "Microservice Architecture, Test-Driven Development (TDD), Continuous Integration (CI), Continuous Delivery (CD), Code Coverage, Code Quality, Token-based Authentication, Containerization, Container Orchestration, Serverless Architecture"
      ]
    },
    {
      "name": {
        "title": "gitopsreact"
      },
      "link": {
        "title": "github.com/darylwalsh/gitopsreact-dot-com",
        "url": "https://github.com/darylwalsh/gitopsreact-dot-com"
      },
      "points": [
        "Test-Driven Development (TDD) throughout the project",
        "Cucumber, Mocha and Selenium to write E2E, integration, unit and UI tests",
        "Stateless APIs using Express and Elasticsearch",
        "Documented API using OpenAPI and Swagger",
        "Build and bundle front-end using React, Redux and Webpack",
        "Containerized services using Docker",
        "Deployed scalable microservices using Kubernetes"
      ]
    }
  ],
  "education": [
    {
      "name": " Masters Business Information Systems (BIS)",
      "blurb": "Michigan State University"
    },
    {
      "name": "Bachelor of Arts",
      "blurb": "Alma College"
    }
  ],
  "skills": {
    "languages": [
      "Javascript",
      "TypeScript",
      "HTML",
      "CSS",
      "Tailwind",
      "jQuery",
      "SASS",
      "Bootstrap",
      "Emotion",
      "Bulma",
      "CSS-in-JS",
      "React Spring"
    ],
    "frameworks": [
      "React",
      "React Native",
      "React Hooks",
      "Redux",
      "GraphQL",
      "Vue",
      "Node",
      "Next.js",
      "Gatsby",
      "Express",
      "Angular"
    ],
    "uidesigns": [
      "Adobe Creative Suite (Photoshop, Illustrator, XD)",
      "Sketch",
      "Figma",
      "Abstract",
      "Moqups",
      "GIMP",
      "Balsamiq"
    ],
    "middleware": [
      "Node",
      "Spring Boot", 
      "Python/Flask",
      "Phoenix",
      "PHP",
      "Ruby on Rails"
    ],
    "testings": [
      "Jest",
      "Playwright",
      "RTL",
      "Cypress",
      "Cucumber",
      "Karma",
      "Protractor",
      "Puppeteer",
      "Chai",
      "Mocha",
      "Selenium"
    ],
    "scriptings": [
      "Elixir",
      "Python",
      "Go",
      "Shell Scripting"
    ],
    "databases": [
      "Postgres",
      "MySQL/MariaDB",
      "SQL Server",
      "Oracle",
      "MongoDB",
      "Redis",
      "TinkerPop"
    ],
    "clouds": [
      "Amazon Web Services (AWS)",
      "Google Cloud Platform (GCP)",
      "Digital Ocean (DO)",
      "IBM Cloud",
      "Amplify Serverless"
    ],
    "technologies": [
      "Ansible",
      "Terraform",
      "Docker",
      "Docker Compose/Swarm",
      "Kubernetes",
      "Helm",
      "Jenkins",
      "Git",
      "Postman",
      "Linux (CentOS/RedHat, Debian/Ubuntu, Arch)"
    ]
  },
  "meta": {
    "source": {
      "title": "github.com/darylwalsh/darylresume",
      "url": "https://github.com/darylwalsh/darylresume"
    }
  }
}